// components/sectionsData.tsx
import React from 'react';

export const sectionsData = [
  {
    id: 'individualConsultation',
    title: 'Индивидуальная консультация',
    content: (
      <>
        <p>Личные встречи, направленные на решение эмоциональных и психологических проблем.</p>
        <p>Помогаем осознать внутренние конфликты, справляться с тревогой, депрессией и стрессом.</p>
        <p>Формат встреч — онлайн и офлайн, на ваш выбор.</p>
      </>
    ),
  },
  {
    id: 'crisisConsulting',
    title: 'Кризисное консультирование',
    content: (
      <>
        <p>Помощь в сложных жизненных ситуациях, когда необходима срочная поддержка.</p>
        <p>Мы предлагаем поддержку и стратегии для преодоления кризисов, чтобы помочь вам восстановить эмоциональное равновесие и найти пути решения.</p>
      </>
    ),
  },
  {
    id: 'groupTherapy',
    title: 'Групповая терапия',
    content: (
      <>
        <p>Групповая терапия — это возможность работать над личными вопросами в кругу людей с похожими трудностями. </p>
        <p>Поддержка группы и профессиональное руководство помогают глубже понять себя, развить навыки общения и улучшить эмоциональное состояние.</p>
      </>
    ),
  },
  {
    id: 'transactionalAnalysisTherapy',
    title: 'Терапия через транзакционный анализ',
    content: (
      <>
        <p>Терапия, основанная на методе транзакционного анализа, помогает понять и изменить поведенческие паттерны, которые влияют на взаимоотношения и качество жизни.</p>
        <p>Мы исследуем роли, которые вы играете, и учимся строить более здоровые коммуникации.</p>
      </>
    ),
  },
  {
    id: 'burnoutConsulting',
    title: 'Консультации для профессионального выгорания',
    content: (
      <>
        <p>Поддержка для тех, кто испытывает эмоциональное и физическое выгорание на работе.</p>
        <p>Мы поможем вам восстановить энергию, осознать причины стресса и разработать план для возвращения к балансу и продуктивности.</p>
      </>
    ),
  },
];
